<template>
  <div class="cart-list">
    <!-- Отсутствует v-bind:key -->
    <div v-for="item in spisok_dlya_rendera">
      <!-- Фактически, пользователю выводятся все данные об объекте.
       А что если данные получаются из БД?
       Ршение - некоторое визуальное представление выводимых данных -->
      {{ item }}
    </div>
  </div>
</template>

<script>
export default {
  // Компонента, очевидно, не работает, если не передавать пропс,
  // необходимо, задать дефолтное значение и/или required: true.
  props: {
    cart: Array,
  },
  computed: {
      // Нейминг по-русски "попахивает", решение - другое название для свойства.
      spisok_dlya_rendera() {
          // reverse() - изменяет массив, к которому применяется - могут возникнуть казусные ситуации + 
          // + фактически мы изменили пропс.
          // Решение - использование копии массива.
          return this.cart.reverse();
      },
  },
};
</script>

<style>

</style>
